{
  "appName": "RemoteApps",
  "longAppName": "RemoteApp and Desktop Connections",
  "device": "device",
  "app": "app",
  "application": "application",
  "dialog": {
    "close": "Close",
    "cancel": "Cancel",
    "ok": "OK",
    "always": "Always",
    "once": "Just once"
  },
  "profile": {
    "changePassword": "Change a password",
    "signOut": "Sign out"
  },
  "titlebar": {
    "updateAvailable": "Update available"
  },
  "favorites": {
    "title": "Favorites",
    "getStarted": "Get started with favorites",
    "prose": {
      "description": "Favoriting makes it easy to get to your most-used devices and apps.",
      "howTo": "Add to favorites via the menu button near the device or app name."
    },
    "allDevices": "All devices",
    "allApps": "All apps",
    "goToDevices": "Go to devices",
    "goToApps": "Go to apps",
    "disable": "Disable favorites"
  },
  "devices": {
    "title": "Devices",
    "search": "Search devices"
  },
  "apps": {
    "title": "Apps",
    "search": "Search apps"
  },
  "simple": {
    "title": "Apps and desktops",
    "search": "Search apps and desktops"
  },
  "settings": {
    "title": "Settings",
    "favorites": {
      "title": "Favorites",
      "disabledNoAnchorPos": "This setting is disabled beacuse your browser does not support CSS Anchor Positioning.",
      "switch": "Enable favorites",
      "import": "Import",
      "export": "Export"
    },
    "flatMode": {
      "title": "Flatten folders",
      "desc": " On views that support folders, flatten folders to show all apps and desktops in a single list.",
      "switch": "Enable flat mode"
    },
    "iconBackgrounds": {
      "title": "Icon backgrounds",
      "desc": " Add a square background with padding to app and desktop icons for better visibility.",
      "switch": "Enable icon backgrounds"
    },
    "combineTerminalServersMode": {
      "title": "Combine apps across servers",
      "desc": "Show only one icon for each app, regardless of the number of terminal servers they are hosted on. If multiple terminal servers are available, a prompt to select one will be shown when launching the app.",
      "switch": "Enable combined apps",
      "disabledNoDialogs": " This setting is disabled because your browser does not support the <code>requestClose()</code> method on <code>&lt;dialog &#47;&gt;</code> elements"
    },
    "simpleMode": {
      "title": "Simple mode",
      "desc": "Enable simple mode to use a compact, combined, single-page list of apps and desktops.",
      "desc2": "The flatten folders option is supported. All other pages and features will be disabled.",
      "switch": "Enable simple mode"
    },
    "hidePorts": {
      "title": "Hide ports from terminal server names",
      "desc": "Hide the terminal server's port from the list of apps and desktops when only one port is used for a hostname",
      "switch": "Hide ports when possible"
    },
    "workspaceUrl": {
      "title": "Workspace URL",
      "copy": "Copy workspace URL",
      "copyEmail": "Copy workspace email"
    },
    "about": {
      "title": "About",
      "appDesc": "A web interface for your RemoteApps and Desktops hosted on Windows 10, 11 and Server. Powered by RAWeb.",
      "learnMore": "Learn more on GitHub",
      "coreVersion": "Server version",
      "webVersion": "App version",
      "updates": {
        "checking": "Checking for updates…",
        "available": "An update is available",
        "rateLimited": "Failed to check for updates (rate limited). Please try again later.",
        "upToDate": "Up to date"
      }
    }
  },
  "policies": {
    "title": "Policies",
    "table": {
      "setting": "Setting",
      "state": "State"
    },
    "state": {
      "enabled": "Enabled",
      "disabled": "Disabled",
      "unset": "Not configured"
    },
    "dialog": {
      "help": "Description",
      "state": "State",
      "options": "Options"
    },
    "TerminalServerAliases": {
      "title": "Configure aliases for terminal servers",
      "help": "Customize the name of the hosting server that appears in RAWeb or any of the remote desktop clients, or customize the names of the terminal servers for your remote apps and desktops. \n\nWhen enabled, you can add aliases for terminal servers. The alias will be used in the RAWeb interface and all workspace clients. \n\nIf disabled or not configured, the terminal server names will be used as-is. \n\nExample: If you have a terminal server named 'TS1' and you want it to appear as 'Geospatial Analysis Server', you can add an alias with 'TS1' as the key and 'Geospatial Analysis Server' as the value. "
    },
    "App.CombineTerminalServersModeEnabled": {
      "title": "Combine apps across terminal servers",
      "help": "Controls the availability of the option to combine RemoteApps across terminal servers. \n\nIf enabled, only one icon for each app will be shown, regardless of the number of terminal servers they are hosted on. If multiple terminal servers are available, a prompt to select one will be shown when launching the app. \n\nIf disabled, each terminal server will show its own icon for each app. \n\nIf not configured, each user will be able to control this setting. It will default to being enabled."
    },
    "App.FavoritesEnabled": {
      "title": "Enable favorites",
      "help": "Controls the availability of the favorites feature in RAWeb. \n\nIf enabled, users will be able to favorite apps and desktops and access them from the favorites page. \n\nIf disabled, the favorites feature will not be available. \n\nIf not configured, each user will be able to control this setting."
    },
    "App.FlatModeEnabled": {
      "title": "Flatten folders",
      "help": "Controls the availability of the flat mode feature in RAWeb. \n\nIf enabled, folders will be flattened to show all apps in a single list. \n\nIf disabled, folders will be shown as-is. \n\nIf not configured, each user will be able to control this setting."
    },
    "App.IconBackgroundsEnabled": {
      "title": "Show backgrounds for icons on cards",
      "help": "Controls the availability of the icon backgrounds feature in RAWeb. \n\nIf enabled, a square background with padding will be added to app and desktop icons for better visibility. The square background is only added when the display mode is 'card'. \n\nIf disabled, icons will not have backgrounds. \n\nIf not configured, each user will be able to control this setting."
    },
    "App.SimpleModeEnabled": {
      "title": "Only show a combined list of apps and desktops",
      "help": "Controls the availability of the simple mode feature in RAWeb. \n\nIf enabled, a compact, combined, single-page list of apps and desktops will be shown instead of separate tabs for desktops and apps. \n\nIf disabled, the full RAWeb interface will be available. \n\nIf not configured, each user will be able to control this setting. \n\nThis setting only has an effect when "
    },
    "App.HidePortsEnabled": {
      "title": "Hide ports from terminal server names",
      "help": "Controls whether the terminal server's port will be hidden from the list of apps and desktops when only one port is used for a hostname. \n\nIf enabled, the port will be hidden from the terminal server name in the list of apps and desktops. \n\nIf disabled, the port will be shown in the terminal server name. \n\nIf not configured, each user will be able to control this setting."
    },
    "RegistryApps.Enabled": {
      "title": "Show RemoteApps listed in the registry",
      "help": "Controls whether RemoteApps listed in the registry will appear in the list of apps. \n\nIf enabled, RemoteApps listed in the registry will be shown in the apps list. \n\nIf disabled or not configured, RemoteApps listed in the registry will not be shown. \n\nRemoteApps can be added to the registry using RemoteApp Tool. The 'TSWebAccess' option must be set to 'Yes' for the RemoteApp to be included by RAWeb."
    },
    "RegistryApps.FullAddressOverride": {
      "title": "Override the full address for generated RDP files for RemoteApps listed in the registry",
      "help": "Replace the default 'full address' in generated RDP files for registry RemoteApps. By default, the 'full address' is formed by the terminal server's IPv4 address and RDP port. \n\nIf enabled, the 'full address' will be set to the value of the origin option. \n\nIf disabled or not configured, the full address will not be changed from the default.\n\nThe origin option should be a well-formed origin, such as https://example.com:3389. The port is optional, and if not specified, the default RDP port (3389) will be used by most clients. \n\nThis option is useful when the terminal server is behind a reverse proxy or should be accessed via a specific hostname or IP address."
    },
    "RegistryApps.AdditionalProperties": {
      "title": "Add additional RDP file properties to RemoteApps listed in the registry",
      "help": "Specify RDP file properties to be appended to RDP files generated for RemoteApps listed in the registry. \n\nIf enabled, the specified properties will be added to the RDP file. \n\nIf disabled or not configured, no additional properties will be added. \n\nThe properties should be specified exactly as they would appear in the RDP file. Specify one property at a time. The properties will be added to the RDP file as-is, so ensure they are valid RDP properties. \n\nDescriptions of properties are available at https://kimmknight.github.io/rdpfileeditor."
    },
    "Workspace.ShowMultiuserResourcesUserAndGroupNames": {
      "title": "Place multi-user resources in virtual folders with the associated user or group name",
      "help": "Controls whether user and group resources will be placed into virtual folders with the associated user or group name in the workspace feed. \n\nIf enabled or not configured, user and group resources will be placed in a virtual folder matching the associated user or group name. \n\nIf disabled, the resources will be placed in the root virtual folder. \n\nFor example, a resource in the '/multiuser-resources/users/kimmknight/tools' folder will be placed in a virtual folder named '/kimmknight/tools' when enabled or not configured and '/tools' when disabled."
    },
    "UserCache.Enabled": {
      "title": "Enable the user cache",
      "help": "Controls whether the user cache is enabled. Enabling the user cache allows logins to occur even when the domain controller cannot be reached by RAWeb. \n\nWith the cache enabled, logins can only occur if the account has previously signed in to RAWeb while the domain controller could be reached or if the account has previously signed in the the device that hosts RAWeb. \n\nThe cache is stored in a SQLite database at \"App_Data\\usercache.sqlite\". The cache contains username, domain, user SID, full name, and groups (SIDs and names). \n\nThe cache is only created and updated when this policy is enabled. The cache is not deleted if this policy is disabled after previosly being enabled. \n\nIf enabled, the user cache is used when the domain controller cannot be reached. \n\nIf disabled or not configured, the user cache is never used."
    },
    "UserCache.StaleWhileRevalidate": {
      "title": "Configure the maximum allowed age of cached user credentials before revalidation is required",
      "help": "Controls when RAWeb can respond immediately with cached credentials. The user cache must be enabled for this policy to take effect. \n\nInstead of retrieving the user information from the domain controller before responding, the user cache can be used for quicker responses. This is important in cases where a domain controller is slow to respond because it is at a remote site. \n\nWith this option, RAWeb immediately uses cached credentials that are not stale. After every request, credentials are revalidated in the background. This behavior is similar to HTTP's stale-while-revalidate. Revalidation is debounced by 5 seconds. \n\nIf enabled, you can customize the maximum age of cached credentials before RAWeb will try to revalidate them before responding to client requests. \nSet the maximum cache age to -1 or 0 to never attempt to revalidate credentials that are already cached. \nSet the maximum cache age to 1 to maximize revalidation attempts. \n\nIf disabled or not configured, RAWeb will attempt to revalidate credentials older than 59 seconds before responding to client requests. \n\nIn all cases, cached credentials will be used if the domain controller cannot be reached."
    },
    "PasswordChange.Enabled": {
      "title": "Allow users to change their password via RAWeb",
      "help": "Controls whether users can change their password via RAWeb. \n\nThis feature does not work if a user does not have the ability in Active Directory to change their password. It will also not work if the raweb application pool does not have permission to access user principals or directory entries. This feature is only supported for local accounts and accounts in the same domain as the machine with RAWeb installed. \n\nThis feature does not control a user's ability to change their password by pressing Ctrl + Alt + End once connected to a remote session. \n\nIf enabled or not configured, users will be able to change their password via the 'Change a password' page. \n\nIf disabled, the 'Change a password' page will not be available."
    },
    "App.Alerts.SignedInUser": {
      "title": "Configure alerts or announcements at the top of every route for signed-in users",
      "help": "Configure custom alerts to be displayed at the top of the web client. \n\nIf enabled, alerts will be shown to users if they are sign in. \n\nIf disabled or not configured, no alerts will be shown. \n\nAlerts may contain a title, message, and hyperlink. Multiple alerts may be displayed. The link will appear at the end of the alert message on a new line and will open in a popup window or new tab. The link will not appear unless the text and URL are specified."
    }
  },
  "wiki": {
    "title": "Wiki"
  },
  "actions": {
    "sort": {
      "label": "Sort",
      "name": "Name",
      "ts": "Terminal server",
      "date": "Date modified",
      "asc": "Ascending",
      "desc": "Descending"
    },
    "view": {
      "label": "View",
      "card": "Card",
      "grid": "Grid",
      "tile": "Tile",
      "list": "List"
    },
    "ts": {
      "label": "Terminal servers",
      "all": "All terminal servers"
    }
  },
  "resource": {
    "menu": {
      "connect": "Connect",
      "connectWith": "Connect with",
      "favAdd": "Add to favorites",
      "favRemove": "Remove from favorites",
      "props": "Properties"
    },
    "props": {
      "title": "Properties",
      "ts": "Terminal server",
      "empty": "empty"
    },
    "tsPicker": {
      "title": "Select a terminal server for"
    },
    "methodPicker": {
      "title": "Select a connection method for",
      "rdpFile": "Download an RDP file",
      "rdpProtocolUri": "Launch via rdp://"
    },
    "getProtocolApp": {
      "title": "Get the Remote Desktop Protocol Handler app",
      "message": "To connect to this resource via rdp://, you need the Remote Desktop Protocol Handler app installed on your device. You can get it from the Microsoft Store.",
      "message2": "Once you have installed the app, click continue.",
      "action": "Continue"
    },
    "getWindowsApp": {
      "title": "Get Windows App",
      "message": "To connect to this resource via rdp://, you need Windows App installed on your device. You can get it from the {{store}}.",
      "message2": "Once you have installed the app, click continue.",
      "action": "Continue"
    }
  },
  "securityError503": {
    "title": "Security Error 5003",
    "message": "The service worker failed to install because the SSL certificate is not trusted by your device. Add the certificate to the trusted root certification authorities store on this computer or configure RAWeb to use a trusted certificate. Performance and functionality may be limited. Offline feaures are unavailable.",
    "action": "Learn more"
  },
  "login": {
    "title": "Sign in",
    "captionContinue": "To continue to",
    "captionOn": "on",
    "incorrectUsernameOrPassword": "Incorrect username or password.",
    "continue": "Continue",
    "continueAnonymous": "Skip",
    "changePasswordButton": "Change your password",
    "securityError503": {
      "title": "Your credentials are at risk",
      "message": "This page is not secure. A malicious actor could steal your password.",
      "action": "View solution",
      "code": "Security Error 5003"
    },
    "server": {
      "unfoundDomain": "Could not sign in because the specified domain is not available. Please make sure the RAWeb server is connected to your domain's network and try again.",
      "localMachineError": "Something went wrong while validating credentials against the local machine. Please try again later.",
      "accountRestrictionError": "There are restrictions on your account that are preventing you from signing in.",
      "invalidLogonHoursError": "Your account has time restrictions that keep you from signing in right now.",
      "invalidWorkstationError": "You are not allowed to sign in to this server.",
      "passwordExpiredError": "The password for this account has expired. {password_change_button}",
      "accountDisabledError": "Your account is currently disabled.",
      "passwordMustChange": "You must change your password before you can sign in. {password_change_button}"
    }
  },
  "domain": "Domain",
  "username": "Username",
  "password": "Password",
  "poweredBy": "Powered by RAWeb",
  "poweredByLearnMore": "Learn more",
  "signOut": {
    "title": "Signing out"
  },
  "changePassword": {
    "title": "Change a password",
    "genericFailureMessage": "Invalid username or password.",
    "oldPassword": "Old password",
    "newPassword": "New password",
    "confirmPassword": "Confirm password",
    "passwordsDoNotMatch": "Passwords do not match.",
    "submit": "Submit",
    "cancel": "Cancel"
  },
  "copyToClipboard": "Copy to clipboard",
  "copiedToClipboard": "Copied to clipboard"
}
